tutorials/lesInterFoam/nozzleFlow2D/0/gamma
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      gamma;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    axis
    {
        type            empty;
    }

    inlet           
    {
        type            fixedValue;
        value           uniform 1;
    }

    wall            
    {
        type            zeroGradient;
    }

    atmosphere      
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }

    front         
    {
        type            wedge;
    }

    back         
    {
        type            wedge;
    }
}

// ************************************************************************* //
